src/cf/AccumulationRegisters/БалансоваяСтоимостьБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>БалансоваяСтоимостьБумаг</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТорговаяПлощадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Брокеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПриобритения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПокупкаЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/InformationRegisters/КотировкиЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КотировкиЦенныхБумаг</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Открытие</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Закрытие</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Максимум</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Минимум</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТорговаяПлощадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПериода</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/ОстаткиДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиДенежныхСредств</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТорговаяПлощадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Брокеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДенежныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Enums/ТипыПериода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыПериода</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОднаМинута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПятьМинут</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПятнадцатьМинут</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТридцатьМинут</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдинЧас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдинДень</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonForms/РабочийСтол/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
//Раздел содержит процедурыобработчики событий формы:
//ПриСозданииНаСервере, ПриОткрытии и т.п.

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    ЗаполнитьБалансовуюСтоимостьБумаг();
    ЗаполнитьОстаткиДенежныхСредств();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ДатаОстатков = ТекущаяДата();
    ДатаОстатковДеньги = ТекущаяДата();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
//Раздел содержит процедурыобработчики
//элементов, расположенных в основной части формы (все, что не связано с таблицами на форме).

&НаКлиенте
Процедура ДатаОстатковПриИзменении(Элемент)
    ЗаполнитьБалансовуюСтоимостьБумаг();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОстатковДеньгиПриИзменении(Элемент)
     ЗаполнитьОстаткиДенежныхСредств();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
//Раздел содержит процедурыобработчики команд формы (имена
//которых задаются в свойстве Действие команд формы).

&НаКлиенте
Процедура ОбновитьБалансовуюСтоимость(Команда)
    ЗаполнитьБалансовуюСтоимостьБумаг();    
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОстаткиДенежныхСредств(Команда)
    ЗаполнитьОстаткиДенежныхСредств();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//Раздел содержит процедуры и функции, составляющие
//внутреннюю реализацию общего модуля. В тех случаях, когда общий модуль является частью
//некоторой функциональной подсистемы, включающей в себя несколько объектов метаданных, в этом
//разделе также могут быть размещены служебные экспортные процедуры и функции,
//предназначенные только для вызова из других объектов данной подсистемы. 
//
//Для объемных общих модулей рекомендуется разбивать этот раздел на подразделы, по
//функциональному признаку.

&НаСервере
Процедура ЗаполнитьБалансовуюСтоимостьБумаг()
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |   БалансоваяСтоимостьБумагОстатки.Бумага КАК Бумага,
    |   БалансоваяСтоимостьБумагОстатки.КоличествоОстаток КАК Количество,
    |   БалансоваяСтоимостьБумагОстатки.СуммаОстаток КАК БалансоваяСтоимость,
    |   БалансоваяСтоимостьБумагОстатки.КоличествоОстаток * ЕСТЬNULL(КотировкиЦенныхБумагСрезПоследних.Закрытие, 0) КАК РасчетнаяСтоимость
    |ИЗ
    |   РегистрНакопления.БалансоваяСтоимостьБумаг.Остатки(&ДатаОстатков, ) КАК БалансоваяСтоимостьБумагОстатки
    |       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КотировкиЦенныхБумаг.СрезПоследних(&ДатаОстатков, ) КАК КотировкиЦенныхБумагСрезПоследних
    |       ПО БалансоваяСтоимостьБумагОстатки.ТорговаяПлощадка = КотировкиЦенныхБумагСрезПоследних.ТорговаяПлощадка
    |           И БалансоваяСтоимостьБумагОстатки.Бумага = КотировкиЦенныхБумагСрезПоследних.Бумага
    |           И (КотировкиЦенныхБумагСрезПоследних.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ТипыПериода.ОдинДень))
    |
    |УПОРЯДОЧИТЬ ПО
    |   Бумага
    |АВТОУПОРЯДОЧИВАНИЕ";
    
    Запрос.УстановитьПараметр("ДатаОстатков", Новый Граница(КонецДня(ДатаОстатков), ВидГраницы.Включая));
    
    РезультатЗапроса = Запрос.Выполнить();
    
    ОстаткиБумаг.Загрузить(РезультатЗапроса.Выгрузить());  
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстаткиДенежныхСредств()
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |   ОстаткиДенежныхСредствОстатки.Счет КАК Счет,
    |   ОстаткиДенежныхСредствОстатки.СуммаОстаток КАК Сумма
    |ИЗ
    |   РегистрНакопления.ОстаткиДенежныхСредств.Остатки(&ДатаОстатков, ) КАК ОстаткиДенежныхСредствОстатки
    |АВТОУПОРЯДОЧИВАНИЕ";
    
    Запрос.УстановитьПараметр("ДатаОстатков", Новый Граница(КонецДня(ДатаОстатковДеньги), ВидГраницы.Включая));
    
    РезультатЗапроса = Запрос.Выполнить();
    
    ОстаткиДенег.Загрузить(РезультатЗапроса.Выгрузить());  
КонецПроцедуры

#КонецОбласти
